In [45]:
from collections import Counter
from scipy.stats import norm
from scipy.stats import t
from scipy.stats import ttest_1samp
from scipy import stats
from scipy.stats import ttest_rel
from scipy.stats import chi2_contingency
from scipy.stats import f_oneway
from scipy.stats import ttest_ind
from statsmodels.stats.proportion import proportions_ztest
import pandas as pd
import numpy as np
import math

# Question 1 :

In [2]:
df1 = pd.read_excel('/media/abhishek/589E61B39E618A782/C-DAC Document/Advanced Analytics/Assignment/Datasets/Sales Data.xlsx', skiprows = 2)

/home/abhishek/anaconda3/lib/python3.8/site-packages/openpyxl/worksheet/_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [3]:
df1

,Customer,Percent Gross Profit,Gross Sales,Gross Profit,Industry Code,Competitive Rating*
0,1,0.51,170.0,86.70,1.0,2.0
1,2,0.32,181.0,57.92,3.0,4.0
2,3,0.20,203.0,40.60,2.0,2.0
3,4,0.22,249.0,54.78,5.0,1.0
4,5,0.21,476.0,99.96,5.0,1.0
...,...,...,...,...,...,...
57,58,0.13,115999.0,15079.87,4.0,5.0
58,59,0.21,120854.0,25379.34,5.0,4.0
59,60,0.14,179101.0,25074.14,6.0,3.0
60,NaN,NaN,NaN,NaN,NaN,NaN
61,*Rates the amount of competition for sales of ...,NaN,NaN,NaN,NaN,NaN

In [4]:
alpha = 0.05

In [5]:
df1_mean = np.mean(df1['Gross Profit'])

In [6]:
Gross = df1['Gross Profit']

In [7]:
df1_mean

4239.164583333333

In [12]:
z_val = stats.norm.ppf(1 - alpha / 2)

In [15]:
stats.ttest_1samp(Gross,4500,alternative = 'greater')

Ttest_1sampResult(statistic=nan, pvalue=nan)

In [14]:
print("p-value :", pval)

p-value : nan

In [38]:
if pval < alpha:   
   print(" we are rejecting null hypothesis")
else:
  print("we are accepting null hypothesis")

we are accepting null hypothesis

# Question 2 :

In [39]:
df2 = pd.read_excel('/media/abhishek/589E61B39E618A782/C-DAC Document/Advanced Analytics/Assignment/Datasets/Ohio Education Performance.xlsx', skiprows = 2)

/home/abhishek/anaconda3/lib/python3.8/site-packages/openpyxl/worksheet/_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [40]:
df2.head(10)

  School District  Writing  Reading  Math  Citizenship  Science   All
0     Indian Hill     95.0     98.0  89.0         95.0     91.0  83.0
1         Wyoming     98.0     96.0  86.0         93.0     87.0  81.0
2      Mason City     96.0     92.0  85.0         94.0     86.0  72.0
3         Madiera     94.0     95.0  88.0         82.0     88.0  69.0
4       Mariemont     99.0     92.0  74.0         89.0     88.0  68.0
5        Sycamore     85.0     88.0  80.0         87.0     84.0  68.0
6    Forest Hills     93.0     91.0  73.0         85.0     88.0  67.0
7     Kings Local     92.0     86.0  78.0         82.0     78.0  64.0
8          Lakota     90.0     88.0  73.0         85.0     81.0  64.0
9        Loveland     85.0     93.0  72.0         86.0     86.0  61.0

In [45]:
alpha = 0.05

In [41]:
data1 = df2['Writing']
data2 = df2['Reading']
data3 = df2['Math']
data4 = df2['Science']

In [42]:
stat, pval = ttest_rel(data1, data2)

In [43]:
pval

nan

In [44]:
stat

nan

In [46]:
if pval > alpha:
	print('we are rejecting null hypothesis')
else:
	print('we are accepting null hypothesis')

we are accepting null hypothesis

In [50]:
stat1, pval1 = ttest_rel(data3, data4)

In [53]:
pval1

nan

In [54]:
stat1

nan

In [55]:
if pval1 > alpha:
	print('we are rejecting null hypothesis')
else:
	print('we are accepting null hypothesis')

we are accepting null hypothesis

# Question 3 :

In [2]:
df3 = pd.read_excel('/media/abhishek/589E61B39E618A782/C-DAC Document/Advanced Analytics/Assignment/Datasets/Facebook Survey.xlsx', skiprows = 2)

In [3]:
df3.head(5)

,Student,Gender,Hours online/week,Friends,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,1,female,4,150,NaN,NaN,NaN
1,2,female,10,400,NaN,NaN,NaN
2,3,male,7,120,NaN,NaN,NaN
3,4,male,15,500,NaN,NaN,NaN
4,5,female,9,260,NaN,NaN,NaN

In [99]:
df3.iloc[:,1:3].count()

Gender               33
Hours online/week    33
dtype: int64

In [4]:
table=pd.crosstab(df3["Gender"],df3["Hours online/week"])

In [5]:
table

Hours online/week  2   3   4   5   6   7   8   9   10  12  15
Gender
female              4   0   3   2   2   3   1   2   1   2   0
male                0   1   3   2   3   1   1   0   1   0   1

In [102]:
f_obs=table.loc["female"].tolist()+table.loc["male"].tolist()
f_obs_arr=np.array(f_obs)
f_obs_arr.shape=( 2,11)

In [103]:
f_obs

[4, 0, 3, 2, 2, 3, 1, 2, 1, 2, 0, 0, 1, 3, 2, 3, 1, 1, 0, 1, 0, 1]

In [104]:
print("Observation Array")
print(f_obs_arr)
print(chi2_contingency(f_obs_arr))

Observation Array
[[4 0 3 2 2 3 1 2 1 2 0]
 [0 1 3 2 3 1 1 0 1 0 1]]
(10.172884615384614, 0.42545879976665707, 10, array([[2.42424242, 0.60606061, 3.63636364, 2.42424242, 3.03030303,
        2.42424242, 1.21212121, 1.21212121, 1.21212121, 1.21212121,
        0.60606061],
       [1.57575758, 0.39393939, 2.36363636, 1.57575758, 1.96969697,
        1.57575758, 0.78787879, 0.78787879, 0.78787879, 0.78787879,
        0.39393939]]))

In [7]:
t = stats.ttest_rel(df3["Gender"],df3["Hours online/week"])

TypeError: unsupported operand type(s) for -: 'str' and 'int'

# Question 4 :

In [34]:
df4 = pd.read_excel('/media/abhishek/589E61B39E618A782/C-DAC Document/Advanced Analytics/Assignment/Datasets/Consumer Transportation Survey.xlsx', skiprows = 2)

In [35]:
df4.head(5)

,Vehicle Driven,Type,Satisfaction with vehicle,Gender,Age,# of hours per week in vehicle,Miles driven per week,NumberOfChildren,Average number of riders,Miles from work,...,Unnamed: 41,Unnamed: 42,Unnamed: 43,Unnamed: 44,Unnamed: 45,Unnamed: 46,Unnamed: 47,Unnamed: 48,Unnamed: 49,Unnamed: 50
0,Truck,Domestic,Yes,Male,31.0,10.0,450.0,0.0,1.0,30.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Truck,Domestic,Yes,Male,29.0,5.0,370.0,1.0,1.0,22.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Truck,Foreign,No,Male,26.0,12.0,580.0,0.0,1.0,15.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Truck,Domestic,No,Male,18.0,6.0,300.0,0.0,1.0,20.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,SUV,Domestic,Yes,Male,49.0,21.0,1000.0,0.0,1.0,22.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## 1 : Individual spend at least 8 hours per week in their vehicles.

In [36]:
H0=" Individual spend at least 8 hours per week in their vehicles."
H1=" Individual spend less than 8 hours per week in their vehicles."
alpha=0.05
t,p=stats.ttest_1samp(df4['# of hours per week in vehicle'],8)
Lower_critical_value=stats.t.ppf(alpha,len(df4)-1)
print("t =",t,"\nLower critical value =",Lower_critical_value,"\np =",p)

t = nan
Lower critical value = -1.6759050245283318
p = nan

In [37]:
if Lower_critical_value<t:
    print("\nWe accept Null Hypothesis. \nConclusion :",H0)
else:
    print("\nWe reject Null Hypothesis. \nConclusion :",H1)

We reject Null Hypothesis.
Conclusion :  Individual spend less than 8 hours per week in their vehicles.

## 2 : Individuals drive an average of 600 miles per week.

In [39]:
H0="Individuals drive an average of 600 miles per week."
H1="Individuals does not drive an average of 600 miles per week."
alpha=0.05
t,p=ttest_1samp(df4['Miles driven per week'],600)
c_val=stats.t.ppf(1-alpha/2,len(df4)-1)
print("t =",t,"\nc_val =",c_val,"\np =",p,"\n")

t = nan
c_val = 2.008559109715206
p = nan

In [40]:
if t<c_val:
    print("We accept Null Hypothesis. \nConclusion :",H0)
else:
    print("We reject Null Hypothesis. \nConclusion :",H1)

We reject Null Hypothesis.
Conclusion : Individuals does not drive an average of 600 miles per week.

## 3 : The average age of SUV drivers is no greater than 35

In [42]:
H0="The average age of SUV drivers is no greater than 35."
H1="The average age of SUV drivers is greater than 35."
alpha=0.05
pd=df4[df4['Vehicle Driven']=='SUV']
t,p=ttest_1samp(pd['Age'],35)
upper_critical_value=stats.t.ppf(1-alpha,len(pd)-1)
print("t =",t,"\nUpper critical value =",upper_critical_value,"\np =",p)

t = 2.2210983164738285
Upper critical value = 1.7613101357748562
p = 0.043349319430440215

In [43]:
if t<upper_critical_value:
    print("\nWe accept Null Hypothesis. \nConclusion :",H0)
else:
    print("\nWe reject Null Hypothesis. \nConclusion :",H1)

We reject Null Hypothesis.
Conclusion : The average age of SUV drivers is greater than 35.

## 4 : At least 80% of individuals are satisfied with their vehicles.

In [46]:
H0="At least 80% of individuals are satisfied with their vehicles."
H1="At least 80% of individuals are not satisfied with their vehicles."
alpha=0.05
n=len(df4[df4['Satisfaction with vehicle']=='Yes'])
N=len(df4)
p=0.80
z,pval=proportions_ztest(n,N,p,alternative='larger')
print("Z =",z,"\np-value =",pval)

Z = -1.7503265001544308
p-value = 0.9599690046474415

In [47]:
if pval<alpha:
    print("\nWe reject Null  Hypothesis. \nConlusion :",H1)
else:
    print("\nWe accept Null Hypothesis. \nConclusion :",H0)

We accept Null Hypothesis.
Conclusion : At least 80% of individuals are satisfied with their vehicles.

# Question 5 :

In [19]:
df5 = pd.read_excel('/media/abhishek/589E61B39E618A782/C-DAC Document/Advanced Analytics/Assignment/Datasets/Vacation Survey.xlsx', skiprows = 2)

/home/abhishek/anaconda3/lib/python3.8/site-packages/openpyxl/worksheet/_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [20]:
df5.head(10)

   Age  Gender Relationship Status   Vacations per Year  Number of Children
0   24    Male             Married                    2                   0
1   26  Female             Married                    4                   0
2   28    Male             Married                    2                   2
3   33    Male             Married                    4                   0
4   45    Male             Married                    2                   0
5   49    Male             Married                    1                   2
6   29    Male             Married                    4                   0
7   37    Male             Married                    1                   2
8   37    Male             Married                    5                   1
9   38    Male             Married                    1                   5

In [24]:
H0="The mean number of vacations taken by married individuals is less than the number taken by single/divorced individuals."
H1="The mean number of vacations taken by married individuals is not less than the number taken by single/divorced individuals."
alpha1=0.05
alpha2=0.01
pd1=df5[df5['Relationship Status']=="Married"]
pd2=df5[df5['Relationship Status']!="Married"]
t,p=ttest_ind(pd1[' Vacations per Year'],pd2[' Vacations per Year'])
lb1=stats.t.ppf(alpha1,(len(pd1)-1)*(len(pd2)-1))
lb2=stats.t.ppf(alpha2,(len(pd1)-1)*(len(pd2)-1))
print("t =",t,"\np =",p,"\nlb1 =",lb1,"\nlb2 =",lb2)

t = -2.2666884468718296
p = 0.03030494245929161
lb1 = -1.652248085992657
lb2 = -2.344496972099134

In [25]:
if p>alpha1:
    print("\nWe accept Null Hypothesis at ",alpha1,"significance. \nConclusion :",H0)
else:
    print("\nWe reject Null Hypothesis at ",alpha1,"significance. \nConclusion :",H1)
if p>alpha2:
    print("\nWe accept Null Hypothesis at ",alpha2,"significance. \nConclusion :",H0)
else:
    print("\nWe reject Null Hypothesis at ",alpha2,"significance. \nConclusion :",H1)

We reject Null Hypothesis at  0.05 significance.
Conclusion : The mean number of vacations taken by married individuals is not less than the number taken by single/divorced individuals.

We accept Null Hypothesis at  0.01 significance.
Conclusion : The mean number of vacations taken by married individuals is less than the number taken by single/divorced individuals.

In [26]:
if lb1<t:
    print("\nWe accept Null Hypothesis at ",alpha1,"significance. \nConclusion :",H0)
else:
    print("\nWe reject Null Hypothesis at ",alpha1,"significance. \nConclusion :",H1)
if lb2<t:
    print("\nWe accept Null Hypothesis at ",alpha2,"significance. \nConclusion :",H0)
else:
    print("\nWe reject Null Hypothesis at ",alpha2,"significance. \nConclusion :",H1)

We reject Null Hypothesis at  0.05 significance.
Conclusion : The mean number of vacations taken by married individuals is not less than the number taken by single/divorced individuals.

We accept Null Hypothesis at  0.01 significance.
Conclusion : The mean number of vacations taken by married individuals is less than the number taken by single/divorced individuals.

# Question 6 :

In [77]:
df6 = pd.read_excel('/media/abhishek/589E61B39E618A782/C-DAC Document/Advanced Analytics/Assignment/Datasets/Cell Phone Survey.xlsx', skiprows = 2)

/home/abhishek/anaconda3/lib/python3.8/site-packages/openpyxl/worksheet/_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [78]:
df6.head(5)

,Gender,Carrier,Type,Usage,Signal strength,Value for the Dollar,Customer Service
0,M,AT&T,Smart,High,5,4,4
1,M,AT&T,Smart,High,5,4,2
2,M,AT&T,Smart,Average,4,4,4
3,M,AT&T,Smart,Very high,2,3,3
4,M,AT&T,Smart,Very high,5,5,2

In [79]:
df6.columns

Index(['Gender', 'Carrier', 'Type', 'Usage', 'Signal strength',
       'Value for the Dollar', 'Customer Service'],
      dtype='object')

In [82]:
d1=df6.loc[df6["Type"]=="Smart"]["Value for the Dollar"]
d2=df6.loc[df6["Type"]=="Camera"]["Value for the Dollar"]
d3=df6.loc[df6["Type"]=="Basic"]["Value for the Dollar"]

In [84]:
print(f_oneway(d1,d2,d3))

F_onewayResult(statistic=3.111194352801031, pvalue=0.05345420071280545)

# Question 7 :

In [85]:
df7 = pd.read_excel('/media/abhishek/589E61B39E618A782/C-DAC Document/Advanced Analytics/Assignment/Datasets/Accounting Professionals.xlsx', skiprows = 2)

/home/abhishek/anaconda3/lib/python3.8/site-packages/openpyxl/worksheet/_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [87]:
df7.head(10)

,Employee,Gender,Years of Service,Years Undergraduate Study,Graduate Degree?,CPA?,Age Group,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,1,F,17,4,N,Y,41-45,NaN,NaN,NaN
1,2,F,6,2,N,N,26-30,NaN,NaN,NaN
2,3,M,8,4,Y,Y,31-35,NaN,NaN,NaN
3,4,F,8,4,Y,N,31-35,NaN,NaN,NaN
4,5,M,16,4,Y,Y,36-40,NaN,NaN,NaN
5,6,F,21,1,N,Y,51-55,NaN,NaN,NaN
6,7,M,27,4,N,N,51-55,NaN,NaN,NaN
7,8,F,7,4,Y,Y,26-30,NaN,NaN,NaN
8,9,M,8,4,N,N,31-35,NaN,NaN,NaN
9,10,M,23,2,N,Y,41-45,NaN,NaN,NaN

In [89]:
table=pd.crosstab(df7.iloc[:,4],df7["Age Group"])

In [90]:
table

Age Group         21-25  26-30  31-35  36-40  41-45  46-50  51-55
Graduate Degree?
N                     1      4      2      1      2      2      5
Y                     0      2      3      3      0      1      1

In [93]:
f_obs=table.loc["N"].tolist()+table.loc["Y"].tolist()
f_obs_arr=np.array(f_obs)
f_obs_arr.shape=( 2, 7 )

In [94]:
chi2_contingency(f_obs_arr)

(6.4879411764705885,
 0.370802780240566,
 6,
 array([[0.62962963, 3.77777778, 3.14814815, 2.51851852, 1.25925926,
         1.88888889, 3.77777778],
        [0.37037037, 2.22222222, 1.85185185, 1.48148148, 0.74074074,
         1.11111111, 2.22222222]]))